results/experiments/phase-a1/2026-02-11_stress-tests/raw/s3_hybrid_reactive_20260211_023705.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/zahid/work/master-s2-study/thesis-kubernetes-serverless-integration/infrastructure/load-testing/stress-slo-violation.js
        output: -

     scenarios: (100.00%) 3 scenarios, 550 max VUs, 2m20s max duration (incl. graceful stop):
              * warmup: 10.00 iterations/s for 20s (maxVUs: 20-50, gracefulStop: 30s)
              * spike: 100.00 iterations/s for 1m0s (maxVUs: 200-500, startTime: 20s, gracefulStop: 30s)
              * cooldown: 20.00 iterations/s for 30s (maxVUs: 30-50, startTime: 1m20s, gracefulStop: 30s)

time="2026-02-11T02:34:24+07:00" level=info msg="\n🔥 SLO Violation Stress Test" source=console
time="2026-02-11T02:34:24+07:00" level=info msg="============================" source=console
time="2026-02-11T02:34:24+07:00" level=info msg="Target: http://localhost:18082" source=console
time="2026-02-11T02:34:24+07:00" level=info msg="Endpoint: /fib?n=35 (CPU-intensive, saturates at 100+ concurrent)" source=console
time="2026-02-11T02:34:24+07:00" level=info msg="Goal: Trigger SCALE_OUT decisions by exceeding SLO threshold" source=console
time="2026-02-11T02:34:24+07:00" level=info source=console
time="2026-02-11T02:34:24+07:00" level=info msg="Phase A (0-20s): Warmup @ 10 RPS" source=console
time="2026-02-11T02:34:24+07:00" level=info msg="Phase B (20-80s): Spike @ 100 RPS (should saturate K8s)" source=console
time="2026-02-11T02:34:24+07:00" level=info msg="Phase C (80-110s): Cooldown @ 20 RPS" source=console
time="2026-02-11T02:34:24+07:00" level=info source=console

running (0m01.0s), 010/230 VUs, 0 complete and 0 interrupted iterations
warmup     [   5% ] 10/20 VUs  01.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    19.0s     
cooldown • [   0% ] waiting    1m19.0s   

running (0m02.0s), 020/230 VUs, 0 complete and 0 interrupted iterations
warmup     [  10% ] 20/20 VUs  02.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    18.0s     
cooldown • [   0% ] waiting    1m18.0s   

running (0m03.0s), 025/235 VUs, 0 complete and 0 interrupted iterations
warmup     [  15% ] 25/25 VUs  03.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    17.0s     
cooldown • [   0% ] waiting    1m17.0s   

running (0m04.0s), 030/240 VUs, 0 complete and 0 interrupted iterations
warmup     [  20% ] 30/30 VUs  04.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    16.0s     
cooldown • [   0% ] waiting    1m16.0s   

running (0m05.0s), 035/245 VUs, 0 complete and 0 interrupted iterations
warmup     [  25% ] 35/35 VUs  05.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    15.0s     
cooldown • [   0% ] waiting    1m15.0s   

running (0m06.0s), 040/250 VUs, 0 complete and 0 interrupted iterations
warmup     [  30% ] 40/40 VUs  06.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    14.0s     
cooldown • [   0% ] waiting    1m14.0s   

running (0m07.0s), 045/255 VUs, 0 complete and 0 interrupted iterations
warmup     [  35% ] 45/45 VUs  07.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    13.0s     
cooldown • [   0% ] waiting    1m13.0s   

running (0m08.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  40% ] 50/50 VUs  08.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    12.0s     
cooldown • [   0% ] waiting    1m12.0s   
time="2026-02-11T02:34:32+07:00" level=warning msg="Insufficient VUs, reached 50 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=warmup

running (0m09.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  45% ] 50/50 VUs  09.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    11.0s     
cooldown • [   0% ] waiting    1m11.0s   

running (0m10.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  50% ] 50/50 VUs  10.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    10.0s     
cooldown • [   0% ] waiting    1m10.0s   

running (0m11.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  55% ] 50/50 VUs  11.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    09.0s     
cooldown • [   0% ] waiting    1m09.0s   

running (0m12.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  60% ] 50/50 VUs  12.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    08.0s     
cooldown • [   0% ] waiting    1m08.0s   

running (0m13.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  65% ] 50/50 VUs  13.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    07.0s     
cooldown • [   0% ] waiting    1m07.0s   

running (0m14.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  70% ] 50/50 VUs  14.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    06.0s     
cooldown • [   0% ] waiting    1m06.0s   

running (0m15.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  75% ] 50/50 VUs  15.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    05.0s     
cooldown • [   0% ] waiting    1m05.0s   

running (0m16.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  80% ] 50/50 VUs  16.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    04.0s     
cooldown • [   0% ] waiting    1m04.0s   

running (0m17.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  85% ] 50/50 VUs  17.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    03.0s     
cooldown • [   0% ] waiting    1m03.0s   

running (0m18.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  90% ] 50/50 VUs  18.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    02.0s     
cooldown • [   0% ] waiting    1m02.0s   

running (0m19.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  95% ] 50/50 VUs  19.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    01.0s     
cooldown • [   0% ] waiting    1m01.0s   

running (0m20.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [ 100% ] 50/50 VUs  20.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    00.0s     
cooldown • [   0% ] waiting    1m00.0s   

running (0m21.0s), 149/260 VUs, 0 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [   2% ] 099/200 VUs  0m01.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m59.0s      

running (0m22.0s), 249/260 VUs, 0 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [   3% ] 199/200 VUs  0m02.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m58.0s      

running (0m23.0s), 299/310 VUs, 0 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [   5% ] 249/250 VUs  0m03.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m57.0s      

running (0m24.0s), 349/360 VUs, 0 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [   7% ] 299/300 VUs  0m04.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m56.0s      

running (0m25.0s), 399/409 VUs, 1 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [   8% ] 349/349 VUs  0m05.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m55.0s      

running (0m26.0s), 449/459 VUs, 1 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  10% ] 399/399 VUs  0m06.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m54.0s      

running (0m27.0s), 499/509 VUs, 1 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  12% ] 449/449 VUs  0m07.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m53.0s      

running (0m28.0s), 549/550 VUs, 1 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  13% ] 499/499 VUs  0m08.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m52.0s      
time="2026-02-11T02:34:52+07:00" level=warning msg="Insufficient VUs, reached 500 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=spike

running (0m29.0s), 550/550 VUs, 1 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  15% ] 500/500 VUs  0m09.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m51.0s      

running (0m30.0s), 550/550 VUs, 2 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  17% ] 500/500 VUs  0m10.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m50.0s      

running (0m31.0s), 550/550 VUs, 2 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  18% ] 500/500 VUs  0m11.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m49.0s      

running (0m32.0s), 550/550 VUs, 2 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  20% ] 500/500 VUs  0m12.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m48.0s      

running (0m33.0s), 550/550 VUs, 2 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  22% ] 500/500 VUs  0m13.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m47.0s      

running (0m34.0s), 550/550 VUs, 2 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  23% ] 500/500 VUs  0m14.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m46.0s      

running (0m35.0s), 550/550 VUs, 3 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  25% ] 500/500 VUs  0m15.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m45.0s      

running (0m36.0s), 528/550 VUs, 25 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  27% ] 500/500 VUs  0m16.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m44.0s      

running (0m37.0s), 528/550 VUs, 25 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  28% ] 500/500 VUs  0m17.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m43.0s      

running (0m38.0s), 528/550 VUs, 25 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  30% ] 500/500 VUs  0m18.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m42.0s      

running (0m39.0s), 528/550 VUs, 25 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  32% ] 500/500 VUs  0m19.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m41.0s      

running (0m40.0s), 528/550 VUs, 26 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  33% ] 500/500 VUs  0m20.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m40.0s      

running (0m41.0s), 528/550 VUs, 26 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  35% ] 500/500 VUs  0m21.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m39.0s      

running (0m42.0s), 528/550 VUs, 26 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  37% ] 500/500 VUs  0m22.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m38.0s      

running (0m43.0s), 528/550 VUs, 26 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  38% ] 500/500 VUs  0m23.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m37.0s      

running (0m44.0s), 528/550 VUs, 26 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  40% ] 500/500 VUs  0m24.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m36.0s      

running (0m45.0s), 527/550 VUs, 87 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  42% ] 499/500 VUs  0m25.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m35.0s      

running (0m46.0s), 527/550 VUs, 187 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  43% ] 499/500 VUs  0m26.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m34.0s      

running (0m47.0s), 527/550 VUs, 287 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  45% ] 499/500 VUs  0m27.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m33.0s      

running (0m48.0s), 527/550 VUs, 387 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  47% ] 499/500 VUs  0m28.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m32.0s      

running (0m49.0s), 527/550 VUs, 487 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  48% ] 499/500 VUs  0m29.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m31.0s      

running (0m50.0s), 527/550 VUs, 587 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  50% ] 499/500 VUs  0m30.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m30.0s      

running (0m51.0s), 499/550 VUs, 687 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  52% ] 499/500 VUs  0m31.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m29.0s      

running (0m52.0s), 499/550 VUs, 787 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  53% ] 499/500 VUs  0m32.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m28.0s      

running (0m53.0s), 499/550 VUs, 887 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  55% ] 499/500 VUs  0m33.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m27.0s      

running (0m54.0s), 499/550 VUs, 987 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  57% ] 499/500 VUs  0m34.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m26.0s      

running (0m55.0s), 499/550 VUs, 1087 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  58% ] 499/500 VUs  0m35.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m25.0s      

running (0m56.0s), 499/550 VUs, 1187 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  60% ] 499/500 VUs  0m36.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m24.0s      

running (0m57.0s), 499/550 VUs, 1287 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  62% ] 499/500 VUs  0m37.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m23.0s      

running (0m58.0s), 499/550 VUs, 1387 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  63% ] 499/500 VUs  0m38.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m22.0s      

running (0m59.0s), 499/550 VUs, 1487 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  65% ] 499/500 VUs  0m39.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m21.0s      

running (1m00.0s), 500/550 VUs, 1506 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  67% ] 500/500 VUs  0m40.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m20.0s      

running (1m01.0s), 500/550 VUs, 1540 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  68% ] 500/500 VUs  0m41.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m19.0s      

running (1m02.0s), 500/550 VUs, 1540 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  70% ] 500/500 VUs  0m42.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m18.0s      

running (1m03.0s), 500/550 VUs, 1540 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  72% ] 500/500 VUs  0m43.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m17.0s      

running (1m04.0s), 500/550 VUs, 1540 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  73% ] 500/500 VUs  0m44.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m16.0s      

running (1m05.0s), 500/550 VUs, 1540 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  75% ] 500/500 VUs  0m45.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m15.0s      

running (1m06.0s), 500/550 VUs, 1541 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  77% ] 500/500 VUs  0m46.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m14.0s      

running (1m07.0s), 500/550 VUs, 1541 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  78% ] 500/500 VUs  0m47.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m13.0s      

running (1m08.0s), 500/550 VUs, 1542 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  80% ] 500/500 VUs  0m48.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m12.0s      

running (1m09.0s), 500/550 VUs, 1542 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  82% ] 500/500 VUs  0m49.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m11.0s      

running (1m10.0s), 500/550 VUs, 1542 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  83% ] 500/500 VUs  0m50.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m10.0s      

running (1m11.0s), 500/550 VUs, 1543 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  85% ] 500/500 VUs  0m51.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m09.0s      

running (1m12.0s), 500/550 VUs, 1561 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  87% ] 500/500 VUs  0m52.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m08.0s      

running (1m13.0s), 500/550 VUs, 1565 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  88% ] 500/500 VUs  0m53.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m07.0s      

running (1m14.0s), 500/550 VUs, 1571 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  90% ] 500/500 VUs  0m54.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m06.0s      

running (1m15.0s), 500/550 VUs, 1573 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  92% ] 500/500 VUs  0m55.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m05.0s      

running (1m16.0s), 095/550 VUs, 2040 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  93% ] 095/500 VUs  0m56.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m04.0s      

running (1m17.0s), 194/550 VUs, 2041 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  95% ] 194/500 VUs  0m57.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m03.0s      

running (1m18.0s), 294/550 VUs, 2041 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  97% ] 294/500 VUs  0m58.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m02.0s      

running (1m19.0s), 394/550 VUs, 2041 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [  98% ] 394/500 VUs  0m59.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m01.0s      

running (1m20.0s), 491/550 VUs, 2044 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s           10.00 iters/s
spike      [ 100% ] 491/500 VUs  1m00.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m00.0s      

running (1m21.0s), 513/550 VUs, 2044 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [   3% ] 20/30 VUs    01.0s/30s  20.00 iters/s

running (1m22.0s), 528/550 VUs, 2044 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [   7% ] 35/35 VUs    02.0s/30s  20.00 iters/s

running (1m23.0s), 533/550 VUs, 2049 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  10% ] 45/45 VUs    03.0s/30s  20.00 iters/s
time="2026-02-11T02:35:48+07:00" level=warning msg="Insufficient VUs, reached 50 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=cooldown

running (1m24.0s), 537/550 VUs, 2050 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  13% ] 50/50 VUs    04.0s/30s  20.00 iters/s

running (1m25.0s), 532/550 VUs, 2055 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  17% ] 50/50 VUs    05.0s/30s  20.00 iters/s

running (1m26.0s), 528/550 VUs, 2059 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  20% ] 50/50 VUs    06.0s/30s  20.00 iters/s

running (1m27.0s), 527/550 VUs, 2060 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  23% ] 50/50 VUs    07.0s/30s  20.00 iters/s

running (1m28.0s), 525/550 VUs, 2062 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  27% ] 50/50 VUs    08.0s/30s  20.00 iters/s

running (1m29.0s), 522/550 VUs, 2065 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  30% ] 50/50 VUs    09.0s/30s  20.00 iters/s

running (1m30.0s), 518/550 VUs, 2069 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  33% ] 50/50 VUs    10.0s/30s  20.00 iters/s

running (1m31.0s), 516/550 VUs, 2071 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  37% ] 50/50 VUs    11.0s/30s  20.00 iters/s

running (1m32.0s), 513/550 VUs, 2074 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  40% ] 50/50 VUs    12.0s/30s  20.00 iters/s

running (1m33.0s), 506/550 VUs, 2082 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  43% ] 50/50 VUs    13.0s/30s  20.00 iters/s

running (1m34.0s), 504/550 VUs, 2085 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  47% ] 50/50 VUs    14.0s/30s  20.00 iters/s

running (1m35.0s), 498/550 VUs, 2091 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  50% ] 50/50 VUs    15.0s/30s  20.00 iters/s

running (1m36.0s), 487/550 VUs, 2104 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  53% ] 49/50 VUs    16.0s/30s  20.00 iters/s

running (1m37.0s), 481/550 VUs, 2112 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  57% ] 50/50 VUs    17.0s/30s  20.00 iters/s

running (1m38.0s), 481/550 VUs, 2112 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  60% ] 50/50 VUs    18.0s/30s  20.00 iters/s

running (1m39.0s), 481/550 VUs, 2112 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  63% ] 50/50 VUs    19.0s/30s  20.00 iters/s

running (1m40.0s), 481/550 VUs, 2112 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  67% ] 50/50 VUs    20.0s/30s  20.00 iters/s

running (1m41.0s), 481/550 VUs, 2112 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  70% ] 50/50 VUs    21.0s/30s  20.00 iters/s

running (1m42.0s), 481/550 VUs, 2112 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  73% ] 50/50 VUs    22.0s/30s  20.00 iters/s

running (1m43.0s), 481/550 VUs, 2112 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  77% ] 50/50 VUs    23.0s/30s  20.00 iters/s

running (1m44.0s), 117/550 VUs, 2476 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 493/500 VUs  1m0s       100.00 iters/s
cooldown   [  80% ] 36/50 VUs    24.0s/30s  20.00 iters/s

running (1m45.0s), 021/550 VUs, 2592 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s       100.00 iters/s
cooldown   [  83% ] 21/50 VUs    25.0s/30s  20.00 iters/s

running (1m46.0s), 037/550 VUs, 2596 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s       100.00 iters/s
cooldown   [  87% ] 37/50 VUs    26.0s/30s  20.00 iters/s

running (1m47.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s       100.00 iters/s
cooldown   [  90% ] 50/50 VUs    27.0s/30s  20.00 iters/s

running (1m48.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s       100.00 iters/s
cooldown   [  93% ] 50/50 VUs    28.0s/30s  20.00 iters/s

running (1m49.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s       100.00 iters/s
cooldown   [  97% ] 50/50 VUs    29.0s/30s  20.00 iters/s

running (1m50.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s        10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s       100.00 iters/s
cooldown   [ 100% ] 50/50 VUs    30.0s/30s  20.00 iters/s

running (1m51.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (1m52.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (1m53.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (1m54.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (1m55.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (1m56.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (1m57.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (1m58.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (1m59.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m00.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m01.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m02.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m03.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m04.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m05.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m06.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m07.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m08.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m09.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m10.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m11.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m12.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m13.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m14.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m15.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m16.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m17.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m18.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m19.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s

running (2m20.0s), 050/550 VUs, 2601 complete and 28 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 50/50 VUs    30s   20.00 iters/s
time="2026-02-11T02:36:44+07:00" level=info msg="\n📊 Stress Test Results" source=console
time="2026-02-11T02:36:44+07:00" level=info msg="======================" source=console
time="2026-02-11T02:36:44+07:00" level=info msg="Duration: 140s" source=console
time="2026-02-11T02:36:44+07:00" level=info msg="\n🔍 Check routing daemon logs for SCALE_OUT decisions" source=console
time="2026-02-11T02:36:44+07:00" level=info msg="Expected: High p99 latency during spike triggers Algorithm 1 SCALE_OUT" source=console


  █ THRESHOLDS 

    http_req_duration{phase:spike}
    ✗ 'p(99)<5000' p(99)=54.77s

    http_req_duration{phase:warmup}
    ✗ 'p(99)<500' p(99)=35.67s

    slo_violations
    ✓ 'count>10' count=1110


  █ TOTAL RESULTS 

    checks_total.......: 10404  74.311524/s
    checks_succeeded...: 44.22% 4601 out of 10404
    checks_failed......: 55.77% 5803 out of 10404

    ✗ status is 200
      ↳  4% — ✓ 120 / ✗ 2481
    ✗ response < 200ms (SLO)
      ↳  57% — ✓ 1491 / ✗ 1110
    ✗ response < 1s
      ↳  57% — ✓ 1493 / ✗ 1108
    ✗ response < 5s
      ↳  57% — ✓ 1497 / ✗ 1104

    CUSTOM
    errors.........................: 95.38% 2481 out of 2601
    response_time..................: avg=15380.51347 min=0.129453 med=0.559822 max=55031.438884 p(90)=51510.838992 p(95)=53722.729425
    slo_violations.................: 1110   7.928277/s

    HTTP
    http_req_duration..............: avg=15.37s      min=129.45µs med=559.99µs max=55.03s       p(90)=51.5s        p(95)=53.72s      
      { expected_response:true }...: avg=11.93s      min=992.73µs med=12.61s   max=23.63s       p(90)=17.57s       p(95)=19.05s      
      { phase:spike }..............: avg=15.18s      min=129.45µs med=549.22µs max=55.03s       p(90)=51.66s       p(95)=53.76s      
      { phase:warmup }.............: avg=32.85s      min=27.79s   med=33.69s   max=35.69s       p(90)=35.48s       p(95)=35.59s      
    http_req_failed................: 95.34% 2481 out of 2602
    http_reqs......................: 2602   18.585024/s

    EXECUTION
    dropped_iterations.............: 4124   29.456048/s
    iteration_duration.............: avg=15.38s      min=217.08µs med=772.07µs max=55.03s       p(90)=51.51s       p(95)=53.72s      
    iterations.....................: 2601   18.577881/s
    vus............................: 50     min=10           max=550
    vus_max........................: 550    min=230          max=550

    NETWORK
    data_received..................: 552 kB 3.9 kB/s
    data_sent......................: 212 kB 1.5 kB/s



running (2m20.0s), 000/550 VUs, 2601 complete and 78 interrupted iterations
warmup   ✓ [ 100% ] 28/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 000/500 VUs  1m0s  100.00 iters/s
cooldown ✓ [ 100% ] 50/50 VUs    30s   20.00 iters/s
time="2026-02-11T02:36:45+07:00" level=error msg="thresholds on metrics 'http_req_duration{phase:spike}, http_req_duration{phase:warmup}' have been crossed"